const arrayOfLoveWishes = [
"Коханий(а), нехай кожен твій день буде наповнений щастям і моєю безмежною любов’ю!",
  "Ти – найцінніше, що є в моєму житті. Бажаю тобі радості, тепла і взаємної ніжності!",
  "Кохаю тебе всім серцем і бажаю, щоб наша любов лише міцніла з кожним днем!",
  "Нехай кожен ранок починається з твоєї посмішки, а кожен вечір – з моїх обіймів!",
  "Я завжди поруч, щоб зробити тебе найщасливішою (найщасливішим)!",
  "Бажаю тобі легких днів, приємних миттєвостей і безмежного кохання – мого кохання!",
  "Ти – моє натхнення, моя радість і моє щастя. Нехай у твоєму житті буде лише світло!",
  "Я вдячний(а) долі за тебе! Бажаю, щоб кожна мить була сповнена нашої любові!",
  "Нехай усе, про що ти мрієш, здійсниться, а я завжди буду поруч підтримувати і любити тебе!",
  "Ти – моє серце, мій всесвіт, моя доля. Бажаю тобі безмежного щастя і затишку в нашій любові!",
]


document.getElementById('btn_love_wishes').addEventListener('click',() => {
    let index = Math.floor(Math.random() * arrayOfLoveWishes.length)
    document.getElementById('love-wishes').innerText=arrayOfLoveWishes[index]
})